//
//  Habit.m
//  ProtectPlants
//
//  Created by Shotiwan Wattanalarpz on 9/8/14.
//  Copyright (c) 2014 EaseCode Co.Ltd. All rights reserved.
//

#import "Habit.h"
#import "AppDelegate.h"
#import "HabitSend.h"
@interface Habit ()
{
    NSDictionary *dataAll;
    UIScrollView *myScrollView;
    UILabel *Subsection;
    UILabel *PictureDetail;
    UIImageView *titleImgView;
    UIScrollView *scv;
    
    //----Current
    int currentPage;
    int y;
}
@end

@implementation Habit



-(void)eventHome{
    [self.navigationController popToRootViewControllerAnimated:YES];
}


-(void)eventBlack
{
    [self.navigationController popViewControllerAnimated:YES];
}

-(void)viewWillDisappear:(BOOL)animated
{

    //---- set BG NAV-----//
    [self.navigationController.navigationBar setBackgroundImage:[UIImage imageNamed:@"Nav_Diagnosis.png"] forBarMetrics:UIBarMetricsDefault];
    
}



- (void) LoadData{


    dataAll = @{@"Article_1" :
                    @{@"Title":@{@"T1":@"ข้อ 1.",@"T2":@"ลักษณะการกระจายตัวของอาการผิดปกติที่พบในแปลง เป็นอย่างไร"},
                        @"Subsection":@{@"Sub1":@"1.1 พบอาการผิดปกติเป็นบริเวณกว้าง",@"Sub2":@"1.2 พบอาการผิดปกติเป็นจุดๆ กระจายทั่วแปลง"},
                        @"Button_Subsection":@{@"Btn1":@"2",@"Btn2":@"13"},
                        @"Picture":@{@"Picture_1":
                                                  @{@"Pic1":@"pic1.png",@"Pic2":@"pic2.png"}},
                      @"PictureScale":@{@"Scale_1":@"1"},
                      @"dataSend":@{@"Send_1":@""},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                                  @{@"PicDetail1":@"ภาพที่ 1 แปลงปลูกพืชที่แสดงอาการผิดปกติเป็นบริเวณกว้าง",@"PicDetail2":@"ภาพที่ 2 แปลงปลูกพืชที่แสดงอาการผิดปกติเป็นบริเวณกว้าง (2)"}}},
                
                @"Article_2" :
                    @{@"Title":@{@"T1":@"ข้อ 2.",@"T2":@"ระยะเวลาที่เกิดอาการผิดปกติ เป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"2.1 เกิดอาการผิดปกติในระยะเวลาสั้นๆ ชั่วข้ามคืน",@"Sub2":@"2.2 ใช้ระยะเวลานานหลายวันจึงสังเกตเห็นอากรผิดปกติมากขึ้น"},
                      @"Button_Subsection":@{@"Btn1":@"3",@"Btn2":@"5"},
                      @"Picture":@{@"Picture_1":
                                                @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@"1"},
                      @"dataSend":@{@"Send_1":@""},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@""}}},
                
                @"Article_3" :
                    @{@"Title":@{@"T1":@"ข้อ 3.",@"T2":@"อาการผิดปกติที่เกิดเป็นบริเวณกว้างในระยะเวลาสั้นๆนั้น มีการระบาดหรือไม่"},
                      @"Subsection":@{@"Sub1":@"3.1 มีการระบาดหรือแพร่ขยายพื้นที่เสียหายออกไป",@"Sub2":@"3.2 ไม่มีการระบาดหรือแพร่ขยายพื้นที่เสียหายออกไป"},
                      @"Button_Subsection":@{@"Btn1":@"",@"Btn2":@"4"},
                      @"Picture":@{@"Picture_1":
                                                @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากแมลงอพยพผ่านมา"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                                            @{@"PicDetail1":@""}}},
                
                @"Article_4" :
                    @{@"Title":@{@"T1":@"ข้อ 4.",@"T2":@"ลักษณะอาการผิดปกติที่เกิดกับพืช เป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"4.1 เนื้อเยื่อส่วนอ่อน เช่น ตาใบ ดอกอ่อน ผลอ่อน ของพืชแสดงอาการแห้งตาย",
                                      @"Sub2":@"4.2 ใบและกิ่งหักพับ ฉีกขาด",
                                      @"Sub3":@"4.3 อาการตายระหว่างเส้นใบ",
                                      @"Sub4":@"4.4 ใบมีจุดชุ่มน้ำหรือเป็นแผลซีดทางสีน้ำตาล มักเกิดระหว่างเส้นใบหรือขอบใบไหม้"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                                @{@"Pic1":@"pic3.png",@"Pic2":@"pic4.png",@"Pic3":@"pic5.png"},
                                   @"Picture_2":
                                                @{@"Pic1":@"pic6.png",@"Pic2":@"pic7.png"},
                                   @"Picture_3":
                                                @{@"Pic1":@"pic8.png"},
                                   @"Picture_4":
                                                @{@"Pic1":@"pic9.png",@"Pic2":@"pic10.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"2",@"Scale_3":@"1",@"Scale_4":@"2"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากอากาศหนาวเย็นจัด",@"Send_2":@"มักเกิดจากลมพัดแรงมาก",@"Send_3":@"มักเกิดจากแสงแดดเผา",@"Send_4":@"มักเกิดจากอากาศเป็นพิษ"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                                            @{@"PicDetail1":@"ภาพที่ 3 ใบพืชแสดงอาการแห้งตายเป็นจุด",@"PicDetail2":@"ภาพที่ 4 ตาใบ และดอกอ่อนกระทบ อากาศหนาวเย็นจัด",@"PicDetail3":@"ภาพที่ 5 ยอดชะงักการเจริญเติบโตจากอากาศหนาวเย็นจัด"},
                                          @"Picture_Detail_2":
                                                            @{@"PicDetail1":@"ภาพที่ 6 ใบและกิ่งของต้นไม้ หักพับ ฉีกขาดจากลมพัดแรงมาก  (1)",@"PicDetail2":@"ภาพที่ 7 ใบและกิ่งของต้นไม้ หักพับ ฉีกขาดจากลมพัดแรงมาก (2)"},
                                          @"Picture_Detail_3":
                                                            @{@"PicDetail1":@"ภาพที่ 8 ใบของต้นหน้าวัวที่ถูกแดดเผา"},
                                          @"Picture_Detail_4":
                                                            @{@"PicDetail1":@"ภาพที่ 9 ใบฝรั่งเกิดแผลไหม้สีน้ำตาลจากอากาศเป็นพิษ",@"PicDetail2":@"ภาพที่ 10 ใบถั่วเกิดแผลสีน้ำตาลระหว่างเส้นใบจากอากาศเป็นพิษ"}}},
                @"Article_5" :
                    @{@"Title":@{@"T1":@"ข้อ 5.",@"T2":@"ลักษณะอาการผิดปกติ อย่างไร"},
                      @"Subsection":@{@"Sub1":@"5.1 ใบเหลืองเป็นอาการหลัก",@"Sub2":@"5.2 ใบเหลืองไม่ใช่อาการหลัก"},
                      @"Button_Subsection":@{@"Btn1":@"6",@"Btn2":@"10"},
                      @"Picture":@{@"Picture_1":
                                                @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@"1"},
                      @"dataSend":@{@"Send_1":@""},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                                            @{@"PicDetail1":@""}}},
                @"Article_6" :
                    @{@"Title":@{@"T1":@"ข้อ 6.",@"T2":@"พืชแสดงอาการใบเหลืองทั้งใบ หรือไม่"},
                      @"Subsection":@{@"Sub1":@"6.1 เหลืองทั้งใบ",@"Sub2":@"6.2 เหลืองระหว่างเส้นใบ"},
                      @"Button_Subsection":@{@"Btn1":@"7",@"Btn2":@"8"},
                      @"Picture":@{@"Picture_1":
                                                @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@"1"},
                      @"dataSend":@{@"Send_1":@""},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                                            @{@"PicDetail1":@""}}},
                
                @"Article_7" :
                    @{@"Title":@{@"T1":@"ข้อ 7.",@"T2":@"เกิดอาการใบเหลืองทั้งใบ ที่ส่วนใด"},
                      @"Subsection":@{@"Sub1":@"7.1 เฉพาะใบล่างหรือใบแก่",
                                      @"Sub2":@"7.2 เกิดขึ้นทุกส่วนของลำต้น"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                            @{@"Pic1":@"pic11.png",@"Pic2":@"pic12.png",@"Pic3":@"pic13.png"},
                                   @"Picture_2":
                                            @{@"Pic1":@"pic14.png",@"Pic2":@"pic15.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากขาดธาตุไนโตรเจน",@"Send_2":@"มักเกิดจากขาดธาตุกำมะถัน"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                                            @{@"PicDetail1":@"ภาพที่ 11 ต้นกะหล่ำดอกแสดงอาการขาดธาตุไนโตรเจน",@"PicDetail2":@"ภาพที่ 12 ต้นคื่นฉ่ายแสดงอาการขาดธาตุไนโตรเจน",@"PicDetail3":@"ภาพที่ 13 ใบข้าวโพดแสดงอาการขาดธาตุไนโตรเจน"},
                                          @"Picture_Detail_2":
                                                            @{@"PicDetail1":@"ภาพที่ 14 ใบสำปะหลังแสดงอาการขาดธาตุกำมะถัน",@"PicDetail2":@"ภาพที่ 15 ใบข้าวโพดแสดงอาการขาดธาตุกำมะถัน"}}},
                @"Article_8" :
                    @{@"Title":@{@"T1":@"ข้อ 8.",@"T2":@"อาการใบเหลืองที่เกิดขึ้นระหว่างเส้นใบ เกิดกับใบชนิดใด"},
                      @"Subsection":@{@"Sub1":@"8.1 ใบแก่ ด่างเหลืองหรือแดงบริเวณขอบใบ ลามไปที่โคนใบเป็นรูปตัววี",@"Sub2":@"8.2 ใบอ่อน แสดงอาการเหลืองและมีอาการอื่นร่วมด้วย"},
                      @"Button_Subsection":@{@"Btn1":@"",@"Btn2":@"9"},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic16.png",@"Pic2":@"pic17.png"}},
                      @"PictureScale":@{@"Scale_1":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากขาดธาตุแมกนีเซียม"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 16 ใบกะหล่ำดอกแสดงอาการขาดธาตุแมกนีเซียม",@"PicDetail2":@"ภาพที่ 17 ใบมะเขือเทศแสดงอาการขาดธาตุแมกนีเซียม"}}},
                @"Article_9" :
                    @{@"Title":@{@"T1":@"ข้อ 9.",@"T2":@"ลักษณะอาการที่พบบนใบอ่อน และมีอาการอื่นด้วยนั้น อาการเป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"9.1 เส้นใบมีสีเข้ม",
                                      @"Sub2":@"9.2 เนื้อใบที่เป็นสีเหลืองแห้งเป็นจุดๆ",
                                      @"Sub3":@"9.3 ปลายใบและขอบใบยังเป็นสีเขียว ตามด้วยอาการเหลืองที่เส้นใบ ทั้งใบแห้งอย่างรวดเร็ว",
                                      @"Sub4":@"9.4 ใบมีขนาดเล็กมาก เป็นกระจุก ข้อสั้น เป็นพุ่มเตี้ย"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic18.png",@"Pic2":@"pic19.png"},
                                   @"Picture_2":
                                       @{@"Pic1":@"pic20.png",@"Pic2":@"pic21.png",@"Pic3":@"pic22.png"},
                                   @"Picture_3":
                                       @{@"Pic1":@"pic23.png",@"Pic2":@"pic24.png"},
                                   @"Picture_4":
                                       @{@"Pic1":@"pic25.png",@"Pic2":@"pic26.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1",@"Scale_3":@"1",@"Scale_4":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากขาดธาตุเหล็ก",@"Send_2":@"มักเกิดจากขาดธาตุแมงกานีส",@"Send_3":@"มักเกิดจากขาดธาตุทองแดง",@"Send_4":@"มักเกิดจากขาดธาตุสังกะสี"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 18 ใบเชอรี่แสดงอาการขาดธาตุเหล็ก",@"PicDetail2":@"ภาพที่ 19 ใบอ่อนต้นถั่วแสดงอาการขาดธาตุเหล็ก"},
                                          @"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 20 ต้นคื่นฉ่ายแสดงอาการขาดธาตุแมงกานีส",@"PicDetail2":@"ภาพที่ 21 ใบมะเขือเทศแสดงอาการขาดธาตุแมงกานีส",@"PicDetail2":@"ภาพที่ 22 ใบข้าวสาลีแสดงอาการขาดธาตุแมงกานีส"},
                                          @"Picture_Detail_3":
                                              @{@"PicDetail1":@"ภาพที่ 23 ใบพืชแสดงอาการขาดธาตุทองแดง (1)",@"PicDetail2":@"ภาพที่ 24 ใบพืชแสดงอาการขาดธาตุทองแดง (2)"},
                                          @"Picture_Detail_4":
                                              @{@"PicDetail1":@"ภาพที่ 25 ใบส้มแสดงอาการขาดธาตุสังกะสี",@"PicDetail2":@"ภาพที่ 26 ใบข้าวโพดแสดงอาการขาดธาตุสังกะสี"}}},
                @"Article_10" :
                    @{@"Title":@{@"T1":@"ข้อ 10.",@"T2":@"อาการใบเหลืองที่พบไม่ใช่อาการหลัก พบอาการผิดปกตินั้นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"10.1 มักพบที่โคนต้น",
                                      @"Sub2":@"10.2 มักพบที่ส่วนยอด",
                                      @"Sub3":@"10.3 ปลายใบไหม้ ในบริเวณที่แห้งแล้งพบอาการทั้งต้น ใบร่วง ต้นตาย",
                                      @"Sub4":@"10.4 อาการไหม้ลามจากปลายใบ โคนใบ ก้าน ลำต้น ราก บางครั้งพบจุดกระจายทั่วแปลง",
                                      @"Sub5":@"10.5 การเจริญเติบโตผิดปกติ ใบบิดเบี้ยว เรียวแหลม ไหม้ลุกลาม จากยอดไปโคนต้น"},
                      @"Button_Subsection":@{@"Btn1":@"11",@"Btn2":@"12"},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@""},
                                   @"Picture_2":
                                       @{@"Pic1":@""},
                                   @"Picture_3":
                                       @{@"Pic1":@"pic27.png",@"Pic2":@"pic28.png"},
                                   @"Picture_4":
                                       @{@"Pic1":@"pic29.png",@"Pic2":@"pic30.png"},
                                   @"Picture_5":
                                       @{@"Pic1":@"pic31.png",@"Pic2":@"pic32.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1",@"Scale_3":@"1",@"Scale_4":@"1",@"Scale_5":@"1"},
                      @"dataSend":@{@"Send_1":@"",@"Send_2":@"",@"Send_3":@"มักเกิดจากดินเค็ม",@"Send_4":@"มักเกิดจากสารกำจัดวัชพืช",@"Send_5":@"มักเกิดจากสาร 2,4-D"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@""},
                                          @"Picture_Detail_2":
                                              @{@"PicDetail1":@""},
                                          @"Picture_Detail_3":
                                              @{@"PicDetail1":@"ภาพที่ 27 ใบพืชแสดงอาการจากสภาพดินเค็ม",@"PicDetail2":@"ภาพที่ 28 ใบมะม่วงแสดงอาการจากสภาพดินเค็ม"},
                                          @"Picture_Detail_4":
                                              @{@"PicDetail1":@"ภาพที่ 29 ต้นเบญจมาศแสดงอาการจากผลของสารกำจัดพืช",@"PicDetail2":@"ภาพที่ 30 ใบพริกแสดงอาการจากผลของสารกำจัดวัชพืช"},
                                          @"Picture_Detail_5":
                                              @{@"PicDetail1":@"ภาพที่ 31 ต้นอ่อน ที่ได้รับสาร 2,4-D",@"PicDetail2":@"ภาพที่ 32 ใบพืชที่ได้รับสาร 2,4-D"}}},
                @"Article_11" :
                    @{@"Title":@{@"T1":@"ข้อ 11.",@"T2":@"อาการผิดปกติที่พบที่โคนต้น มีอาการอย่างไร"},
                      @"Subsection":@{@"Sub1":@"11.1 ใบมีสีเขียวจัด ใบล่างอาจเป็นสีม่วง ยอดสั้น",
                                      @"Sub2":@"11.2 ใบแก่เหลืองและไหม้ หรือมีจุดสีเหลืองใบม้วน"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                                @{@"Pic1":@"pic33.png",@"Pic2":@"pic34.png"},
                                   @"Picture_2":
                                       @{@"Pic1":@"pic35.png",@"Pic2":@"pic36.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากขาดธาตุฟอสฟอรัส",@"Send_2":@"มักเกิดจากขาดธาตุโพแทสเซียม"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 33 พืชตระกูลกะหล่ำแสดงอาการขาดธาตุ ฟอสฟอรัส",@"PicDetail2":@"ภาพที่ 34 ข้าวโพดแสดงอาการขาดธาตุฟอสฟอรัส"},
                                          @"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 35 พืชตระกูลกะหล่ำแสดงอาการขาดธาตุโพแตสเซียม",@"PicDetail2":@"ภาพที่ 36 มะเขือเทศแสดงอาการขาดธาตุโพแทสเซียม"}}},
                @"Article_12" :
                    @{@"Title":@{@"T1":@"ข้อ 12.",@"T2":@"อาการผิดปกติที่พบที่ส่วนยอด มีอาการอย่างไร"},
                      @"Subsection":@{@"Sub1":@"12.1 ตายอดเสีย แตกออกมาเป็นกระจุก ใบอ่อนหนาเป็นมันใบบิดงอ",
                                      @"Sub2":@"12.2 ใบลีบ ยอดไม่เจริญ บิดงอ ขอบใบฉีดขาด ตายอดตาย รากน้อย ผลแตก / เน่า"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic37.png",@"Pic2":@"pic38.png"},
                                   @"Picture_2":
                                       @{@"Pic1":@"pic39.png",@"Pic2":@"pic40.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากขาดธาตุโบรอน",@"Send_2":@"มักเกิดจากขาดธาตุแคลเซียม"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 37 พืชตระกูลกะหล่ำแสดงอาการขาดธาตุโบรอน (1)",@"PicDetail2":@"ภาพที่ 38 พืชตระกูลกะหล่ำแสดงอาการขาดธาตุโบรอน (2)"},
                                          @"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 39 ต้นพืชแสดงอาการขาดธาตุแคลเซียม",@"PicDetail2":@"ภาพที่ 40 ผลมะเขือเทศแสดงอาการขาดธาตุแคลเซียม"}}},
                @"Article_13" :
                    @{@"Title":@{@"T1":@"ข้อ 13.",@"T2":@"ตัวอย่างพืชที่จะวินิจฉัย ที่พบอาการผิดปกติมีการกระจายตัวในแปลง อาการผิดปกติ ที่พบเป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"13.1 พบร่องรอยการทำลายของแมลง",@"Sub2":@"13.2 ไม่พบร่องรอยการทำลายของแมลง"},
                      @"Button_Subsection":@{@"Btn1":@"14",@"Btn2":@"23"},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@""},
                      @"dataSend":@{@"Send_1":@""},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@""}}},
                @"Article_14" :
                    @{@"Title":@{@"T1":@"ข้อ 14.",@"T2":@"ร่องรอยการทำลายของแมลงที่พบเกิดขึ้นกับส่วนใดของพืช"},
                      @"Subsection":@{@"Sub1":@"14.1 ส่วนใบ",@"Sub2":@"14.2 ส่วนผล",@"Sub3":@"14.3 ส่วนลำต้น",@"Sub4":@"14.4 ส่วนราก",@"Sub5":@"14.5 ส่วนดอก"},
                      @"Button_Subsection":@{@"Btn1":@"15",@"Btn2":@"19",@"Btn3":@"21",@"Btn4":@"22"},
                      @"Picture":@{@"Picture_5":
                                       @{@"Pic1":@"pic41.png",@"Pic2":@"pic42.png"}},
                      @"PictureScale":@{@"Scale_5":@"1"},
                      @"dataSend":@{@"Send_1":@"",@"Send_2":@"",@"Send_3":@"",@"Send_4":@"",@"Send_5":@"มักเกิดจากหนอนกระทู้"},
                      @"Picture_Detail":@{@"Picture_Detail_5":
                                              @{@"PicDetail1":@"ภาพที่ 41 ส่วนของดอกที่ถูกหนอนกระทู้เข้าทำลาย (1)",@"PicDetail2":@"ภาพที่ 42 ส่วนของดอกที่ถูกหนอนกระทู้เข้าทำลาย (2)"}}},
                @"Article_15" :
                    @{@"Title":@{@"T1":@"ข้อ 15.",@"T2":@"ร่องรอยการทำลายของแมลงที่พบที่ใบมีลักษณะอย่างไร"},
                      @"Subsection":@{@"Sub1":@"15.1 ร่องรอยเว้าแหว่ง หรือกัดกิน",@"Sub2":@"15.2 เป็นรูพรุน",@"Sub3":@"15.3 เนื้อใบหงิกย่น",@"Sub4":@"15.4 ผิวใบซีดกร้าน",@"Sub5":@"15.5 ใบและดอกแห้ง",@"Sub6":@"15.6 มีรอยคดเคี้ยวไประหว่างเนื้อใบ"},
                      @"Button_Subsection":@{@"Btn1":@"16",@"Btn2":@"17",@"Btn3":@"18"},
                      @"Picture":@{@"Picture_4":
                                       @{@"Pic1":@"pic43.png",@"Pic2":@"pic44.png"},
                                   @"Picture_5":
                                       @{@"Pic1":@"pic45.png",@"Pic2":@"pic46.png"},
                                   @"Picture_6":
                                       @{@"Pic1":@"pic47.png",@"Pic2":@"pic48.png"}},
                      @"PictureScale":@{@"Scale_4":@"1",@"Scale_5":@"1",@"Scale_6":@"1"},
                      @"dataSend":@{@"Send_4":@"มักเกิดจากไรแดง",@"Send_5":@"มักเกิดจากแมลงดูดกินน้ำเลี้ยง",@"Send_6":@"มักเกิดจากหนอนใบ"},
                      @"Picture_Detail":@{@"Picture_Detail_4":
                                              @{@"PicDetail1":@"ภาพที่ 43 ใบพืชตระกูลส้มที่ถูกไรแดงเข้าทำลาย",@"PicDetail2":@"ภาพที่ 44 ภาพขยายตัวไรแดง"},
                                          @"Picture_Detail_5":
                                              @{@"PicDetail1":@"ภาพที่ 45 ยอดอ่อนมะม่วงที่ถูกแมลงดูดกินน้ำเลี้ยง",@"PicDetail2":@"ภาพที่ 46 ช่อดอกมะม่วงที่ถูกแมลงดูดกินน้ำเลี้ยง"},
                                          @"Picture_Detail_6":
                                              @{@"PicDetail1":@"ภาพที่ 47 พืชตระกูลส้มที่ถูกหนอนชอนใบเข้าทำลาย",@"PicDetail2":@"ภาพที่ 48 ภาพขยายลักษณะการทำลายของหนอนชอนใบ"}}},
                @"Article_16" :
                    @{@"Title":@{@"T1":@"ข้อ 16.",@"T2":@"ลักษณะหรือร่องรอยเว้าแหว่งหรือถูกกัดกินที่พบ เป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"16.1 มีความสม่ำเสมอ",@"Sub2":@"16.2 ไม่สม่ำเสมอ",@"Sub3":@"16.3 กัดเหลือเป็นโครงหรือกัดขาดครึ่งหนึ่ง",@"Sub4":@"16.4 เป็นโครงหรือเป็นร่างแห",@"Sub5":@"16.5 กลางใบเป็นรูโหว่ ไม่สม่ำเสมอ",@"Sub6":@"16.6 กัดกินจากด้านนอกและพบข้อมูลก้อนสีเขียวดำๆ"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic49.png",@"Pic2":@"pic50.png"},
                                   @"Picture_2":
                                       @{@"Pic1":@"pic51.png",@"Pic2":@"pic52.png"},
                                   @"Picture_3":
                                       @{@"Pic1":@"pic53.png"},
                                   @"Picture_4":
                                       @{@"Pic1":@"pic54.png",@"Pic2":@"pic55.png"},
                                   @"Picture_5":
                                       @{@"Pic1":@"pic56.png"},
                                   @"Picture_6":
                                       @{@"Pic1":@"pic57.png",@"Pic2":@"pic58.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1",@"Scale_3":@"1",@"Scale_4":@"1",@"Scale_5":@"1",@"Scale_6":@"2"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากแมลงค่อมทอง",@"Send_2":@"มักเกิดจากหนอนผีเสื้อ",@"Send_3":@"มักเกิดจากด้วงกรีดใบ",@"Send_4":@"มักเกิดจากหนอนบุ้งร่าน",@"Send_5":@"มักเกิดจากหนอนกระทู้,ด้วงต่างๆ",@"Send_6":@"มักเกิดจาก ตั๊กแตน"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 49 ใบมะม่วงที่ถูกแมลงค่อมทองกัดกิน",@"PicDetail2":@"ภาพที่ 50 ภาพขยายตัวแมลงค่อมทอง"},
                                          @"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 51 ใบมะละกอที่ถูกทำลายโดยหนอนผีเสื้อ",@"PicDetail2":@"ภาพที่ 52 ใบคะน้าที่ถูกทำลายโดยหนอนผีเสื้อ"},
                                          @"Picture_Detail_3":
                                              @{@"PicDetail1":@"ภาพที่ 53 ใบพืชที่ถูกด้วงกรีดใบเข้าทำลาย"},
                                          @"Picture_Detail_4":
                                              @{@"PicDetail1":@"ภาพที่ 54 ใบพืชที่ถูกหนอนเข้าทำลายโดยหนอนบุ้งร่าน (1)",@"PicDetail2":@"ภาพที่ 55 ใบพืชที่ถูกหนอนเข้าทำลายโดยหนอนบุ้งร่าน (2)"},
                                          @"Picture_Detail_5":
                                              @{@"PicDetail1":@"ภาพที่ 56 ใบคะน้าที่ถูกทำลายโดยหนอนกระทู้"},
                                          @"Picture_Detail_6":
                                              @{@"PicDetail1":@"ภาพที่ 57 ต้นข้าวที่ถูกตั๊กแตนเข้าทำลาย",@"PicDetail2":@"ภาพที่ 58 ภาพขยายตัวตั๊กแตน"}}},
                
                @"Article_17" :
                    @{@"Title":@{@"T1":@"ข้อ 17.",@"T2":@"ลักษณะของรูพรุนที่เกิดขึ้น เป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"17.1 ร่องรอยถูกกัดกินเป็นรูพรุนด้านล่างใบ",@"Sub2":@"17.2 ถูกกัดกินคลอโรฟิลด์ (ส่วนสีเขียว) ด้านบนใบ"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic59.png",@"Pic2":@"pic60.png",@"Pic3":@"pic61.png"},
                                   @"Picture_2":
                                       @{@"Pic1":@"pic62.png",@"Pic2":@"pic63.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากหนอนใยผัก",@"Send_2":@"มักเกิดจากด้วงหมัดผัก"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 49 ใบมะม่วงที่ถูกแมลงค่อมทองกัดกิน",@"PicDetail2":@"ภาพที่ 50 ภาพขยายตัวแมลงค่อมทอง",@"PicDetail3":@"ภาพที่ 50 ภาพขยายตัวแมลงค่อมทอง"},
                                          @"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 51 ใบมะละกอที่ถูกทำลายโดยหนอนผีเสื้อ",@"PicDetail2":@"ภาพที่ 52 ใบคะน้าที่ถูกทำลายโดยหนอนผีเสื้อ"}}},
                
                @"Article_18" :
                    @{@"Title":@{@"T1":@"ข้อ 18.",@"T2":@"ลักษณะเนื้อใบหงิกย่น ที่พบเป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"18.1 หงิกย่นเข้าหากัน มักพบในใบพริก",@"Sub2":@"18.2 หงิกงอโค้งลงด้านล่าง และมีคราบสีน้ำตาล"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic64.png",@"Pic2":@"pic65.png"},
                                   @"Picture_2":
                                       @{@"Pic1":@"pic66.png",@"Pic2":@"pic67.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากตัวไรพริก",@"Send_2":@"มักเกิดจากเพลี้ยไฟ"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 64 ใบพริกที่ถูกเข้าทำลายโดยตัวไรพริก",@"PicDetail2":@"ภาพที่ 65 ภาพขยายตัวไรพริก"},
                                          @"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 66 ต้นหอมที่ถูกทำลายโดยเพลี้ยไฟ",@"PicDetail2":@"ภาพที่ 67 ต้นพริกที่ถูกทำลายโดยเพลี้ยไฟ"}}},
                @"Article_19" :
                    @{@"Title":@{@"T1":@"ข้อ 19.",@"T2":@"ใบเป็นปุ่มปม แกะปมและดูด้วยแว่นขยายจะเห็นตัวและลักษณะผลที่ถูกทำลาย"},
                      @"Subsection":@{@"Sub1":@"19.1 มีไข่และตัวหนอนอยู่ในปมเช่นในมะม่วง",@"Sub2":@"19.2 ไม่พบไข่แมลงและมักพบกับใบข้าว",@"Sub3":@"19.3 ผลถูกเจาะเป็นรู",@"Sub4":@"19.4 ผลร่วงแห้งตาย",@"Sub5":@"19.5 ผลแห้งผิดรูปร่าง",@"Sub6":@"19.6 เมล็ดถูกเจาะเป็นรู",@"Sub6":@"19.7 ธัญพืชติดเมล็ดไม่เต็ม รวงแห้ง (มักพบในข้าว ข้าวฟ่าง)"},
                      @"Button_Subsection":@{@"Btn3":@"20"},
                      @"Picture":@{@"Picture_2":
                                       @{@"Pic1":@"pic68.png",@"Pic2":@"pic69.png"},
                                   @"Picture_4":
                                       @{@"Pic1":@"pic70.png",@"Pic2":@"pic71.png"},
                                   @"Picture_5":
                                       @{@"Pic1":@"pic72.png",@"Pic2":@"pic73.png"},
                                   @"Picture_6":
                                       @{@"Pic1":@"pic74.png",@"Pic2":@"pic75.png"}},
                      @"PictureScale":@{@"Scale_2":@"2",@"Scale_4":@"2",@"Scale_5":@"2",@"Scale_6":@"2"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากแมลงพวกแตน",@"Send_2":@"มักเกิดจากแมลงบั่ว",@"Send_4":@"มักเกิดจากหนอนเจาะลำต้น",@"Send_5":@"มักเกิดจากมวน",@"Send_6":@"มักเกิดจาก ด้วงงวง และด้วงถั่ว",@"Send_6":@"มักเกิดจากบั่ว, มวน"},
                      @"Picture_Detail":@{@"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 68 ต้นข้าวที่ถูกทำลายโดยแมลงบั่ว",@"PicDetail2":@"ภาพที่ 69 ภาพขยายตัวแมลงบั่ว"},
                                          @"Picture_Detail_4":
                                              @{@"PicDetail1":@"ภาพที่ 70 ต้นข้าวที่ถูกหนอนเจาะลำต้น (1)",@"PicDetail2":@"ภาพที่ 71 ต้นข้าวที่ถูกหนอนเจาะลำต้น (2)"},
                                          @"Picture_Detail_5":
                                              @{@"PicDetail1":@"ภาพที่ 72 ภาพขยายตัวมวน",@"PicDetail2":@"ภาพที่ 73 แมลงสิงดูดกินน้ำเลี้ยงเมล็ดข้าว"},
                                          @"Picture_Detail_6":
                                              @{@"PicDetail1":@"ภาพที่ 74 เมล็ดถั่วที่ถูกแมลงเจาะทำลาย",@"PicDetail2":@"ภาพที่ 75 เมล็ดข้าวโพดที่ถูกแมลเจาะทำลาย"}}},
                @"Article_20" :
                    @{@"Title":@{@"T1":@"ข้อ 20.",@"T2":@"ลักษณะของรูที่เจาะเข้าไปในผล และอาการที่พบ เป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"20.1 เจาะเข้าข้างในและเนื้อผลเน่าเละ",@"Sub2":@"20.2 เจาะเข้าข้างในเป็นรูแบบอุโมงค์ แต่เนื้อผลไม้ไม่เน่า"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic76.png",@"Pic2":@"pic77.png"},
                                   @"Picture_2":
                                       @{@"Pic1":@"pic78.png",@"Pic2":@"pic79.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากแมลงวันผลไม้",@"Send_2":@"มักเกิดจากหนอนเจาะผล"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 76 ผลมะม่วงที่ถูกแมลงวันผลไม้เข้าทำลาย",@"PicDetail2":@"ภาพที่ 77 ภาพขยายแมลวันผลไม้"},
                                          @"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 78 สมอฝ้ายที่ถูกหนอนเจาะทำลาย",@"PicDetail2":@"ภาพที่ 79 ผลทุเรียนที่ถูกหนอนเจาะทำลาย"}}},
                
                @"Article_21" :
                    @{@"Title":@{@"T1":@"ข้อ 21.",@"T2":@"พบร่องรอยการทำลายของแมลงที่ลำต้น เป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"21.1 เจาะลำต้นเป็นรู อาจพบมูลที่ปากทาง",@"Sub2":@"21.2 ยอดแห้งตาย",@"Sub3":@"21.3 มีมูลดินเป็นทางตามลำต้น",@"Sub4":@"21.4 ต้นกล้าถูกกัดขาดระดับดิน"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic80.png"},
                                   @"Picture_2":
                                       @{@"Pic1":@"pic81.png",@"Pic2":@"pic82.png",@"Pic3":@"pic83.png",@"Pic4":@"pic84.png"},
                                   @"Picture_3":
                                       @{@"Pic1":@"pic85.png",@"Pic2":@"pic86.png"},
                                   @"Picture_4":
                                       @{@"Pic1":@"pic87.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1",@"Scale_3":@"1",@"Scale_4":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากหนอนเจาะลำต้น ด้วง",@"Send_2":@"มักเกิดจากหนอนเจาะลำต้น ด้วง",@"Send_3":@"มักเกิดจากปลวก",@"Send_4":@"มักเกิดจากจิ้งหรีด"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 80 ต้นข้าวโพดที่ถูกหนอนเจาะลำต้น"},
                                          @"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 81 ต้นพืชที่ถูกหนอนเจาะลำต้น",@"PicDetail2":@"ภาพที่ 82 ยอดพืชที่ถูกหนอนเจาะลำต้นเข้าทำลาย",@"PicDetail3":@"ภาพที่ 83 ลักษณะการเข้าทำลายจากหนอนเจาะลำต้น (1)",@"PicDetail4":@"ภาพที่ 84 ลักษณะการเข้าทำลายจากหนอนเจาะลำต้น (2)"},
                                          @"Picture_Detail_3":
                                              @{@"PicDetail1":@"ภาพที่ 85 ต้นพืชที่ถูกปลวกเข้าทำลาย (1)",@"PicDetail2":@"ภาพที่ 86 ต้นพืชที่ถูกปลวกเข้าทำลาย (2)"},
                                          @"Picture_Detail_4":
                                              @{@"PicDetail1":@"ภาพที่ 87 ต้นกล้าที่ถูกจิ้งหรีดกัดขาดเหนือระดับดิน"}}},
                @"Article_22" :
                    @{@"Title":@{@"T1":@"ข้อ 22.",@"T2":@"ร่องรอยการทำลายที่ราก เป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"22.1 รากถูกกัดแทะขาด",@"Sub2":@"22.2 รากสะสมอาหารถูกเจาะทำลาย"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic88.png",@"Pic2":@"pic89.png"},
                                   @"Picture_2":
                                       @{@"Pic1":@"pic90.png",@"Pic2":@"pic91.png"}},
                      @"PictureScale":@{@"Scale_1":@"1",@"Scale_2":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากหนอนผีเสื้อ,ด้วง,ปลวก",@"Send_2":@"มักเกิดจากด้วงงวง"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 88 รากพืชถูกแมลงเข้าทำลาย (1)",@"PicDetail2":@"ภาพที่ 89 รากพืชถูกแมลงเข้าทำลาย (2)"},
                                          @"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 90 หัวมันเทศที่ถูกด้วงงวงทำลาย",@"PicDetail2":@"ภาพที่ 91 ภาพขยายตัวด้วงงวงมันเทศ"}}},
                @"Article_23" :
                    @{@"Title":@{@"T1":@"ข้อ 23.",@"T2":@"พบการกระจายตัวของอาการผิดปกติเป็นจุดกระจัดกระจายและไม่พบลักษณะหรือร่องรอยการทำลายของแมลง อาการที่พบเป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"23.1 พบอาการผิดปกติที่ใบ",@"Sub2":@"23.2 พบอาการใบเหี่ยว ต้นตาย"},
                      @"Button_Subsection":@{@"Btn1":@"24",@"Btn2":@"29"},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@""},
                      @"dataSend":@{@"Send_1":@""},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@""}}},
                @"Article_24" :
                    @{@"Title":@{@"T1":@"ข้อ 24.",@"T2":@"อาการที่พบที่ใบ เป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"24.1 ใบขาว ข้อปล้องสั้น พุ่มแจ้ พุ่มไม้กวาดดอกเขียว",@"Sub2":@"24.2 ไม่พบอาการในข้อที่ 24.1"},
                      @"Button_Subsection":@{@"Btn2":@"25"},
                      @"Picture":@{@"Picture_1":
                                            @{@"Pic1":@"pic92.png",@"Pic2":@"pic93.png",@"Pic3":@"pic94.png",@"Pic4":@"pic95.png",@"Pic5":@"pic96.png",@"Pic6":@"pic97.png",
                                            @"Pic7":@"pic98.png",@"Pic8":@"pic99.png"}},
                      @"PictureScale":@{@"Scale_1":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากไฟโตพลาสมา"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 92 พืชแสดงอาการแตกพุ่มแจ้จากเชื้อไฟโตพลาสมา",@"PicDetail2":@"ภาพที่ 93 พืชแสดงอาการใบขาวจากเชื้อไฟโตพลาสมา",
                                                @"PicDetail3":@"ภาพที่ 94 พืชแสดงอาการดอกเขียวจากเชื้อไฟโตพลาสมา",@"PicDetail4":@"ภาพที่ 95 พืชแสดงอาการดอกผิดปกติจากเชื้อไฟโตพลาสมา",
                                                @"PicDetail5":@"ภาพที่ 96 พืชแสดงอาการดอกผิดปกติจากเชื้อไฟโตพลาสมา",@"PicDetail6":@"ภาพที่ 97 เปรียบเทียบต้นพืชที่ผิดปกติจากเชื้อไฟโตพลาสมา",
                                                @"PicDetail7":@"ภาพที่ 98 เปรียบเทียบหัวมันฝรั่งที่ผิดปกติจากเชื้อไฟโตพลาสมา",@"PicDetail8":@"ภาพที่ 99 ลักษณะดอกที่ผิดปกติจากเชื้อไฟโตพลาสมา"}}},
                @"Article_25" :
                    @{@"Title":@{@"T1":@"ข้อ 25.",@"T2":@"ตัดขวางส่วนที่เป็นโรคให้บาง แล้วส่องดูด้วยกล้องจุลทัศน์ เป็นอย่างไร"},
                      @"Subsection":@{@"Sub1":@"25.1 พบของเหลวข้นไหลออกมาจากบริเวณแผล",@"Sub2":@"25.2 ไม่พบของเหลวข้นไหลออกจากบริเวณแผล"},
                      @"Button_Subsection":@{@"Btn2":@"26"},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@""},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากเชื้อแบคทีเรีย"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@""}}},
                @"Article_26" :
                    @{@"Title":@{@"T1":@"ข้อ 26.",@"T2":@"นำชิ้นส่วนพืชที่มีอาการผิดปกติมาให้ความชื้น หรือที่เรียกว่าทำ moist chamber"},
                      @"Subsection":@{@"Sub1":@"26.1 พบเส้นใยฟูขาวเจริญขึ้นมาบริเวณแผล",@"Sub2":@"26.2 ไม่พบเส้นใยฟูขาว"},
                      @"Button_Subsection":@{@"Btn2":@"27"},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic100.png",@"Pic2":@"pic101.png",@"Pic3":@"pic102.png",@"Pic4":@"pic103.png",@"Pic5":@"pic104.png",@"Pic6":@"pic105.png",
                                         @"Pic7":@"pic106.png",@"Pic8":@"pic107.png",@"Pic9":@"pic108.png",@"Pic10":@"pic109.png"}},
                      @"PictureScale":@{@"Scale_1":@"2"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากเชื้อราทั่วไป"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 100 โรคโคนเน่าจากเชื้อรา",@"PicDetail2":@"ภาพที่ 101 โรคสมัจท์หอมหัวใหญ่จากเชื้อรา",
                                                @"PicDetail3":@"ภาพที่ 102 โรคแอนแทรกโนสพริกจากเชื้อรา",@"PicDetail4":@"ภาพที่ 103 โรคผลเน่าจากเชื้อรา",
                                                @"PicDetail5":@"ภาพที่ 104 โรค Damping off จากเชื้อรา",@"PicDetail6":@"ภาพที่ 105 โรคใบจุดจากเชื้อรา",
                                                @"PicDetail7":@"ภาพที่ 106 โรคราน้ำค้างองุ่นจากเชื้อรา",@"PicDetail8":@"ภาพที่ 107 โรคราน้ำค้างข้าวโพดจากเชื้อรา",
                                                @"PicDetail9":@"ภาพที่ 108 โรคราสนิมขาวจากเชื้อรา",@"PicDetail10":@"ภาพที่ 109 โรคเหี่ยวมะเขือเทศจากเชื้อรา"}}},
                @"Article_27" :
                    @{@"Title":@{@"T1":@"ข้อ 27.",@"T2":@"นำใบของพืชมาขยี้น้ำ หรือนำดินบริเวณโคนต้นมาละลายน้ำแล้วนำใบพืช เช่น แตงกวา ใบส้ม มาลอยพบผิวน้ำ พบอะไรบ้าง"},
                      @"Subsection":@{@"Sub1":@"27.1 เส้นใยของเชื้อราเจริญอยู่ที่ชิ้นในพืชล่อ",@"Sub2":@"27.2 ไม่พบเส้นใย"},
                      @"Button_Subsection":@{@"Btn2":@"28"},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@""},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากเชื้อราพวกราน้ำ"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@""}}},
                @"Article_28" :
                    @{@"Title":@{@"T1":@"ข้อ 28.",@"T2":@"ต้องทำการเลี้ยงเชื้อบนอาหารเลี้ยงเชื้อ"},
                      @"Subsection":@{@"Sub1":@"28.1 พบเส้นใยของเชื้อราบนอาหารเลี้ยงเชื้อ",@"Sub2":@"28.2 พบเมือกเยิ้มบนอาหารเลี้ยงเชื้อ",@"Sub3":@"28.3 ไม่พบสิ่งผิดปกติบนอาหารเลี้ยงเชื้อ"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_2":
                                       @{@"Pic1":@"pic110.png",@"Pic2":@"pic111.png",@"Pic3":@"pic112.png",@"Pic4":@"pic113.png",@"Pic5":@"pic114.png",@"Pic6":@"pic115.png"},
                                   @"Picture_3":
                                       @{@"Pic1":@"pic116.png",@"Pic2":@"pic117.png",@"Pic3":@"pic118.png",@"Pic4":@"pic119.png"}},
                      @"PictureScale":@{@"Scale_1":@"2",@"Scale_2":@"2"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากเชื้อราทั่วไป",@"Send_2":@"มักเกิดจากเชื้อแบคทีเรีย",@"Send_3":@"มักเกิดจากเชื้อไวรัส"},
                      @"Picture_Detail":@{@"Picture_Detail_2":
                                              @{@"PicDetail1":@"ภาพที่ 110 โรคขอบใบไหม้จากเชื้อแบคทีเรีย",@"PicDetail2":@"ภาพที่ 111 โรคใบไหม้จากเชื้อแบคทีเรีย",
                                                @"PicDetail3":@"ภาพที่ 112 กิ่งพืชเป็นปุ่มปมจากเชื้อแบคทีเรีย",@"PicDetail4":@"ภาพที่ 113 โรคเน่าเละจากเชื้อแบคทีเรีย",
                                                @"PicDetail5":@"ภาพที่ 114 โรคแคงเกอร์พืชตระกูลส้มจากเชื้อแบคทีเรีย",@"PicDetail6":@"ภาพที่ 115 โรคเน่าเละจากเชื้อแบคทีเรีย"},
                                          @"Picture_Detail_3":
                                              @{@"PicDetail1":@"ภาพที่ 116 ใบถั่วแสดงอาการด่างจากเชื้อไวรัส",@"PicDetail2":@"ภาพที่ 117 โรคจุดวงแหวนมะละกอจากเชื้อไวรัส",
                                                @"PicDetail3":@"ภาพที่ 118 ใบถั่วฝักยาวแสดงอาการผิดปกติจากเชื้อไวรัส",@"PicDetail4":@"ภาพที่ 119 ใบมะเขือเทศแสดงอาการผิดปกติจากเชื้อไวรัส"}}},
                @"Article_29" :
                    @{@"Title":@{@"T1":@"ข้อ 29.",@"T2":@"ต้นพืชที่แสดงอาการต้นเหี่ยว ให้ถอนต้นพืชเพื่อดูทีรากพบลักษณะอย่างไร"},
                      @"Subsection":@{@"Sub1":@"29.1 รากเป็นปกติ",@"Sub2":@"29.2 รากเป็นปม",@"Sub3":@"29.3 รากเป็นรอยแผลสีน้ำตาลหรือ รากกุด"},
                      @"Button_Subsection":@{@"Btn1":@"30",@"Btn2":@"31",@"Btn3":@"32"},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@""},
                      @"dataSend":@{@"Send_1":@""},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@""}}},
                @"Article_30" :
                    @{@"Title":@{@"T1":@"ข้อ 30.",@"T2":@"ตัดขวางลำต้นพืชที่แสดงอาการเหี่ยวจุ่มลงในน้ำ ในภาชนะใน"},
                      @"Subsection":@{@"Sub1":@"30.1 มีของเหลวข้นไหลออกมาทางรอยตัด",@"Sub2":@"30.2 ไม่พบของเหลวข้นไหลออกมา"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@""},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากเชื้อแบคทีเรีย",@"Send_2":@"มักเกิดจากเชื้อรา"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@""}}},
                @"Article_31" :
                    @{@"Title":@{@"T1":@"ข้อ 31.",@"T2":@"รากผิดปกติเป็นปม ให้พิจารณาลักษณะของปม"},
                      @"Subsection":@{@"Sub1":@"31.1 เกิดจากรากขยายตัวบวมทั้งราก สีซีดทดลองขยี้ปมรากในน้ำสะอาด นำน้ำขยี้ปมไว้ส่องด้วยแว่นขยายจะเห็นสิ่งมีชีวิตเล็กๆเคลื่อนไหว",@"Sub2":@"31.2 รากเป็นปมด้านข้างและสีชมพู(ไม่ใช่โรคพืช)"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@"pic120.png",@"Pic2":@"pic121.png"}},
                      @"PictureScale":@{@"Scale_1":@"1"},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากไส้เดือนฝอย",@"Send_2":@"ปมจากแบคทีเรีย Rhizibium"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@"ภาพที่ 120 รากพืชเป็นปุ่มปมจากไส้เดือนฝอย",@"PicDetail2":@"ภาพที่ 121 ฝักถั่วลิสงที่ผิดปกติจากไส้เดือนฝอย"}}},
                @"Article_32" :
                    @{@"Title":@{@"T1":@"ข้อ 32.",@"T2":@"รากเป็นรอยแผลสีน้ำตาล หรือ รากกุด"},
                      @"Subsection":@{@"Sub1":@"32.1 ผ่ารากดูภายใน หรือตรวจดูดินบริเวณใกล้เคียงพบตัวหนอนตัวงอเป็นรูปคล้ายตัว C มีปุ่มขา 3 คู่บริเวณอกแต่ไม่มีตุ่มขาเทียม",
                                      @"Sub2":@"32.2 ไม่พบตัวหนอนแต่ลักษณะรากเปื่อยและถอดเป็นปลอก",
                                      @"Sub3":@"32.3 ไม่พบตัวหนอนและอาการรากถอดปลอก (การวินิจฉัยให้นำดินไปละลายน้ำกรองด้วยกระดาษกรอง นำน้ำที่ได้และส่องดูภายใต้กล้องจุลทรรศน์แบบสเตรอริโอ จะเห็นตัวใส้เดือนฝอย)"},
                      @"Button_Subsection":@{@"Btn1":@""},
                      @"Picture":@{@"Picture_1":
                                       @{@"Pic1":@""}},
                      @"PictureScale":@{@"Scale_1":@""},
                      @"dataSend":@{@"Send_1":@"มักเกิดจากหนอนด้วง",@"Send_2":@"มักเกิดจากเชื้อรา",@"Send_3":@"มักเกิดจากไส้เดือนฝอย"},
                      @"Picture_Detail":@{@"Picture_Detail_1":
                                              @{@"PicDetail1":@""}}},

                
                };

    //NSLog(@"%@",dataAll[@"Article_1"]);
    
    //============== Article ============//
    _aricle = [NSString stringWithFormat:@"Article_%i",currentPage];

}
- (void)LoadUI{
    
    CGSize sc = [[UIScreen mainScreen] bounds].size;
    
    //========== SET BG ===========//
    [self.view setBackgroundColor:[UIColor colorWithRed:1 green:1 blue:1 alpha:1]];
    
    
    
    //---- set BG NAV-----//
    [self.navigationController.navigationBar setBackgroundColor:[UIColor colorWithRed:1 green:1 blue:1 alpha:0]];
    
    
    //========== ShowHead Navigation
    UIImageView  *imgNavigation = [[UIImageView alloc]initWithFrame:CGRectMake(-16, -16, sc.width, 85)];
    [imgNavigation setBackgroundColor:[UIColor clearColor]];
    [imgNavigation setBackgroundColor:[UIColor colorWithRed:1 green:1 blue:1 alpha:1]];
    
    
    //========== Image & Label Head
    UIImageView  *ImgHead = [[UIImageView alloc]initWithFrame:CGRectMake(-16, -16,sc.width,94)];
    [ImgHead setBackgroundColor:[UIColor clearColor]];
    [ImgHead setImage:[UIImage imageNamed:@"Nav_Diagnosis.png"]];
    
    
 
    
    [self.navigationItem setLeftBarButtonItem:nil animated:NO];
    
    
    UIView *view = [[UIView alloc]initWithFrame:CGRectMake(0, 0, 100, 50)];
    [view setBackgroundColor:[UIColor clearColor]];
    
    UIButton* btnBack = [UIButton buttonWithType: UIButtonTypeCustom];
    [btnBack setFrame:CGRectMake(5, -2, 44, 36)];
    [btnBack setBackgroundColor:[UIColor clearColor]];
    [btnBack setImage:[UIImage imageNamed:@"Button-back.png"] forState:UIControlStateNormal];
    [btnBack addTarget:self action:@selector(eventBlack) forControlEvents:UIControlEventTouchDown];
    [view addSubview:imgNavigation];
    [view addSubview:ImgHead];
    [view addSubview:btnBack];

    
    UIBarButtonItem* itemAboutUs =[[UIBarButtonItem alloc]initWithCustomView:view];
    
    
    
    [self.navigationItem setLeftBarButtonItem:itemAboutUs];
    
    
    
   
    if (y >= 35) {
        y=67;
    }
    
    //=========Scrollview
    
    scv = [[UIScrollView alloc]initWithFrame:CGRectMake(0, 35, sc.width, sc.height-90)];
    [scv setDelegate:self];
    [scv setScrollEnabled:YES];
    [scv setBackgroundColor:[UIColor clearColor]];


    
    for (int idx = 0; 1 > idx; idx++) {
        
        
                //------------ Title ข้อ-------------//
                UILabel *lbTitles = [[UILabel alloc]initWithFrame:CGRectMake(12, y, 40, 20)];
                [lbTitles setBackgroundColor:[UIColor clearColor]];
                lbTitles.font = [UIFont fontWithName:@"Helvetica Neue-Bold" size:20.0];
                [lbTitles setText:dataAll[_aricle][@"Title"][@"T1"]];
                [lbTitles setTextAlignment:NSTextAlignmentLeft];
                [lbTitles sizeToFit];
                //[scv addSubview:lbTitles];
        
                //------------ Title Heaad -------------//
                UILabel *lbTitleHeaad = [[UILabel alloc]initWithFrame:CGRectMake(20, y, 280, 60)];
                [lbTitleHeaad setBackgroundColor:[UIColor clearColor]];
                [lbTitleHeaad setTextColor:[UIColor colorWithRed:0.149 green:0.309 blue:0.239 alpha:0.8]];
                [lbTitleHeaad setFont:[UIFont fontWithName:@"Avenir-Heavy" size:18.0]];
                [lbTitleHeaad setLineBreakMode:NSLineBreakByWordWrapping];
                [lbTitleHeaad setNumberOfLines:4];
                [lbTitleHeaad setText: dataAll[_aricle][@"Title"][@"T2"]];
                [lbTitleHeaad setTextAlignment:NSTextAlignmentCenter];
                [lbTitleHeaad sizeToFit];
                [scv addSubview:lbTitleHeaad];
                y = lbTitleHeaad.frame.size.height + lbTitleHeaad.frame.origin.y;
        
        
                for (int idxs = 1; [dataAll[_aricle][@"Subsection"] count] >= idxs; idxs++) {
                    
                    //------- BUTTON  Head ------//
                    NSString *Sub = [NSString stringWithFormat:@"Sub%i",idxs];
                    UILabel *labelNew = [[UILabel alloc]initWithFrame:CGRectMake(18, 5, sc.width-60, 100)];
                    [labelNew setTextColor:[UIColor blackColor]];
                    [labelNew setFont:[UIFont fontWithName:@"Avenir-BookOblique" size:16.0]];
                    [labelNew setBackgroundColor:[UIColor clearColor]];
                    [labelNew setLineBreakMode:NSLineBreakByWordWrapping];
                    [labelNew setNumberOfLines:4];
                    [labelNew setText:dataAll[_aricle][@"Subsection"][Sub]];
                    [labelNew setTextAlignment:NSTextAlignmentCenter];
                    [labelNew sizeToFit];
                    
                    
                    UIButton *btnNews = [UIButton buttonWithType:UIButtonTypeCustom];
                    [btnNews setFrame:CGRectMake(20, y+40,sc.width-40, labelNew.frame.size.height+10)];
                    [btnNews setBackgroundImage:[UIImage imageNamed:@"bg_btn.png"] forState:UIControlStateNormal];
                    [[btnNews layer] setCornerRadius:10];
                    [btnNews addSubview:labelNew];
                    
                    NSString *Strbtn = [NSString stringWithFormat:@"Btn%i",idxs];
                    if ([dataAll[_aricle][@"Button_Subsection"][Strbtn] length] != 0) {

                        [btnNews setTag:idxs];
                        [btnNews addTarget:self action:@selector(evnetPage:) forControlEvents:UIControlEventTouchUpInside];
                        
                    }
                    else {
                    
                        [btnNews setTag:idxs];
                        [btnNews addTarget:self action:@selector(evnetSend:) forControlEvents:UIControlEventTouchUpInside];
                        
                    }
                    
                
                    [scv addSubview:btnNews];
                    
                    y = btnNews.frame.size.height + btnNews.frame.origin.y;
                    

                    

                    
                }
    }
    
    
    
    
    [scv setContentSize:CGSizeMake(sc.width, y+50)];
    [self.view addSubview:scv];

    
    //------- TABBAR HOME ---------//
    
    UIImageView *tabView = [[UIImageView alloc]initWithFrame:CGRectMake(0, sc.height-58, sc.width, 58)];
    [tabView setBackgroundColor:[UIColor clearColor]];
    [tabView setImage:[UIImage  imageNamed:@"tabbar.png"]];
    [self.view addSubview:tabView];
    
    UIButton *btnHome = [[UIButton alloc]initWithFrame:CGRectMake((sc.width-53)/2, sc.height-65, 60, 60)];
    [btnHome setBackgroundColor:[UIColor clearColor]];
    [btnHome setImage:[UIImage imageNamed:@"icon-home.png"] forState:UIControlStateNormal];
    [btnHome addTarget:self action:@selector(eventHome) forControlEvents:UIControlEventTouchUpInside];
    [self.view addSubview:btnHome];
}


-(void)evnetPage:(UIButton *)sender
{


    NSString *Strbtn = [NSString stringWithFormat:@"Btn%li",(long)sender.tag];
    NSLog(@"%@",dataAll[_aricle][@"Button_Subsection"][Strbtn]);
    [scv removeFromSuperview];
    currentPage = [dataAll[_aricle][@"Button_Subsection"][Strbtn] intValue];
    [self LoadData];
    [self LoadUI];

    


}

-(void)evnetSend:(UIButton *)sender
{
    //NSString *StrSend = [NSString stringWithFormat:@"Sub%i",sender.tag];
    //NSLog(@"%@",dataAll[_aricle][@"Subsection"][StrSend]);

    
   
    HabitSend * habitSend = [[HabitSend alloc]init];
    habitSend.SectionData = [[NSMutableArray alloc]initWithObjects:[NSString stringWithFormat:@"%li",(long)sender.tag],dataAll[_aricle], nil];
    
    [self.navigationController  pushViewController:habitSend animated:YES];
    
}


- (void)viewDidLoad
{
    [super viewDidLoad];
    currentPage = 1;
    [self LoadData];
    [self LoadUI];
    
    // Do any additional setup after loading the view.
}

- (void)didReceiveMemoryWarning
{
    [super didReceiveMemoryWarning];
    // Dispose of any resources that can be recreated.
}


@end
